Repository: xeland314/chat_analyzer_ui
Catalog: lib/l10n/app_*.arb
Languages: es

# home_action_tooltip
source: View Full Chat
es: Ver Chat Completo

# home_action_display
source: Display Options
es: Opciones de Visualización

# home_action_reset
source: Reset Analysis
es: Reiniciar Análisis

# home_action_logs
source: View Logs
es: Ver Registros

# initial_view_message_1
source: Drag and drop your .txt file here
es: Arrastra y suelta tu archivo .txt aquí

# initial_view_message_2
source: or
es: o

# initial_view_message_3
source: Load chat file (.txt)
es: Cargar archivo de chat (.txt)

# initial_view_credits_button
source: Credits
es: Créditos

# cat_phrase_1
source: Meow!
es: ¡Miau!

# cat_phrase_4
source: Analyzing chats...
es: Analizando chats...

# cat_phrase_5
source: I saw something I shouldn't have seen...
es: Vi algo que no debí ver...

# cat_phrase_6
source: Cat working, don't disturb...
es: Gatito trabajando, no molestar...

# cat_phrase_7
source: Reading messages...
es: Calculando los chismes... esto tomará un momento.

# cat_phrase_8
source: Counting emojis... 😼
es: Contando emojis... 😼

# cat_phrase_9
source: I will conquer the world... or just the chat
es: Conspirando para dominar el mundo... o solo el chat.

# cat_phrase_10
source: Cleaning paws... almost done.
es: Limpiando las patitas... ya casi termino.

# credits_modal_title
source: Credits
es: Créditos

# credits_modal_intro
source: Developed by xeland314.
es: Desarrollado por xeland314.

# credits_modal_github_profile
source: GitHub Profile
es: Perfil de GitHub

# credits_modal_portfolio
source: Portfolio
es: Portafolio

# credits_modal_donations
source: Donations
es: Donaciones

# credits_modal_close_button
source: Close
es: Cerrar

# credits_modal_buy_me_a_cookie_semantic_label
source: Buy me a cookie at https://www.buymeacoffee.com/xeland314
es: Cómprame una galleta en https://www.buymeacoffee.com/xeland314

# credits_modal_buy_me_a_coffee_semantic_label
source: Buy Me a Coffee at ko-fi.com/C0C41DCI4T
es: Cómprame un café en ko-fi.com/C0C41DCI4T

# disclaimer_modal_text
source: This app only analyzes chats that you manually export from WhatsApp.
es: Esta app analiza solo chats que exportas manualmente de WhatsApp.

# disclaimer_modal_privacy_notice_title
source: Privacy Notice
es: Aviso de Privacidad

# disclaimer_modal_privacy_notice_content
source: This application only processes chats that you manually export from WhatsApp. It does not access your account or automatically collect information. All data is analyzed locally on your device and sensitive information is anonymized to protect the privacy of third parties.
es: Esta aplicación procesa únicamente chats que tú exportas manualmente desde WhatsApp. No accede a tu cuenta ni recopila información automáticamente. Todos los datos se analizan localmente en tu dispositivo y se anonimiza la información sensible para proteger la privacidad de terceros.

# disclaimer_modal_privacy_notice_close_button
source: Close
es: Cerrar

# disclaimer_modal_privacy_notice_touch_to_view
source: Tap here to see the full notice
es: Toca aquí para ver el aviso completo

# display_options_dialog_title
source: Display Options
es: Opciones de Visualización

# display_options_dialog_number_of_words_to_display
source: Number of words to display
es: Número de palabras a mostrar

# display_options_dialog_ignored_words
source: Ignored Words
es: Palabras ignoradas

# display_options_dialog_add_a_word_to_ignore
source: Add a word to ignore
es: Añadir una palabra a ignorar

# display_options_dialog_cancel_button
source: Cancel
es: Cancelar

# display_options_dialog_save_button
source: Save
es: Guardar

# loading_view_pixel_cat_semantic_label
source: Pixelated cat working
es: Gato pixelado trabajando

# chat_date_selector_full_chat
source: Full Chat
es: Chat Completo

# chat_message_list_no_messages
source: No messages on this date.
es: No hay mensajes en esta fecha.

# activity_heatmap_message_activity
source: Message Activity ({year})
es: Actividad de Mensajes ({year})

# activity_heatmap_no_message_activity
source: No message activity for this year.
es: No hay actividad de mensajes para este año.

# activity_heatmap_messages_on_date
source: {count} messages on {date}.
es: {count} mensajes en {date}.

# activity_heatmap_close_button
source: Close
es: Cerrar

# advanced_analysis_view_title
source: Hidden Insights
es: Descubrimientos Ocultos

# advanced_analysis_view_reply_matrix_title
source: Reply Matrix
es: Matriz de Respuestas

# advanced_analysis_view_reply_matrix_info
source: This table shows how many replies each participant received from others.
es: Esta tabla muestra cuántas respuestas recibió cada participante de otros.

# advanced_analysis_view_markov_chain_title
source: Conversation Flow
es: Flujo de Conversación

# advanced_analysis_view_markov_chain_info
source: How likely it is for one person to reply after another.
es: Qué tan probable es que una persona responda después de otra.

# analysis_result_view_advanced_analysis_title
source: Advanced Analysis
es: Análisis Avanzado

# analysis_result_view_view_advanced_analysis_button
source: View Advanced Analysis
es: Ver Análisis Avanzado

# analysis_result_view_chat_analysis_report_filename
source: chat_analysis_report
es: reporte_analisis_chat

# composite_affinity_view_title
source: Strong Connections
es: Conexiones Fuertes

# composite_affinity_view_from_to
source: From \ To
es: Origen \ Destino

# dashboard_view_title
source: Group Summary
es: Resumen del Grupo

# emitter_similarity_view_title
source: Similar Communication Styles
es: Estilos de Comunicación Similares

# emitter_similarity_view_participant_participant
source: Participant \ Participant
es: Participante \ Participante

# frequency_list_view_no_data
source: No data found.
es: No se encontraron datos.

# hourly_activity_chart_title
source: Most Active Hours
es: Horas más Activas

# hourly_activity_chart_messages_tooltip
source: {count} messages
es: {count} mensajes

# markov_chain_view_matrix_copied_snackbar
source: Matrix copied to clipboard (CSV/TSV format)
es: Matriz copiada al portapapeles (formato CSV/TSV)

# markov_chain_view_title
source: Markov Chain - Transition Probabilities
es: Cadena de Markov - Probabilidades de Transición

# markov_chain_view_from_to
source: From \ To
es: Origen \ Destino

# markov_chain_view_copy_matrix_button
source: Copy Transition Matrix
es: Copiar Matriz de Transición

# matrix_squared_view_title
source: Normalized Indirect Influence (M²)
es: Influencia Indirecta Normalizada (M²)

# matrix_squared_view_from_to
source: From \ To
es: Origen \ Destino

# markov_chain_view_export_matrix_button
source: Export Transition Matrix
es: Exportar matriz de transición

# participant_stats_view_subtitle
source: {messageCount} messages, {multimediaCount} multimedia files
es: {messageCount} mensajes, {multimediaCount} archivos multimedia

# participant_stats_view_most_common_words
source: Most Common Words
es: Palabras más Comunes

# participant_stats_view_most_common_emojis
source: Most Common Emojis
es: Emojis más Comunes

# receiver_similarity_view_title
source: Similar Communication Roles
es: Roles Comunicacionales

# receiver_similarity_view_participant_participant
source: Participant \ Participant
es: Participante \ Participante

# reply_matrix_table_copied_snackbar
source: Reply table copied to clipboard (TSV format)
es: Tabla de respuestas copiada al portapapeles (formato TSV)

# reply_matrix_table_replier_to
source: Replier \ To
es: Respondedor \ A

# reply_matrix_table_out_degree
source: Messages sent
es: Mensajes enviados

# reply_matrix_table_balance
source: Balance (sent - received)
es: Balance (enviados - recibidos)

# reply_matrix_table_title
source: Who Replies to Whom
es: Quién Responde a Quién

# reply_matrix_table_in_degree
source: Messages received
es: Mensajes recibidos

# reply_matrix_table_copy_button
source: Copy Reply Table
es: Copiar Tabla de Respuestas

# display_options_dialog_language_selector_title
source: Language
es: Idioma

# language_english
source: English
es: Inglés

# language_spanish
source: Spanish
es: Español

# response_time_chart_title
source: Average Response Time
es: Tiempo de Respuesta Promedio

# sentiment_bar_chart_title
source: Sentiment Analysis
es: Análisis de Sentimiento

# sentiment_bar_chart_positive_tooltip
source: Positive: {percent}%
es: Positivo: {percent}%

# sentiment_bar_chart_negative_tooltip
source: Negative: {percent}%
es: Negativo: {percent}%

# sentiment_bar_chart_positive_legend
source: {count} positive
es: {count} positivo

# sentiment_bar_chart_negative_legend
source: {count} negative
es: {count} negativo

# sentiment_heatmap_title
source: Sentiment Trend ({year})
es: Tendencia de Sentimiento ({year})

# sentiment_heatmap_no_data
source: No sentiment data for this year.
es: No hay datos de sentimiento para este año.

# sentiment_heatmap_positive
source: Positive
es: Positivo

# sentiment_heatmap_negative
source: Negative
es: Negativo

# sentiment_heatmap_snackbar_content
source: {sentimentText} sentiment ({score}) on {date}.
es: Sentimiento {sentimentText} ({score}) en {date}.

# sentiment_heatmap_close_button
source: Close
es: Cerrar

# starters_enders_view_title
source: Conversation Starters & Enders
es: Iniciadores y Finalizadores de Conversación

# starters_enders_view_starters_title
source: Starters
es: Iniciadores

# starters_enders_view_enders_title
source: Enders
es: Finalizadores

# temporal_analysis_view_title
source: Temporal Analysis
es: Análisis Temporal

# threshold_slider_title
source: Conversation Threshold
es: Umbral de Conversación

# threshold_slider_description
source: Detected natural threshold: {duration}. Use the slider to adjust.
es: Umbral natural detectado: {duration}. Usa el deslizador para ajustar.

# equity_gauges_title
source: Participation Equity
es: Equidad de Participación

# equity_gauges_speaking_equity
source: Speaking Equity
es: Equidad al Hablar

# equity_gauges_listening_equity
source: Listening Equity
es: Equidad al Escuchar

# equity_gauges_description
source: (0 = perfect equality, 1 = perfect inequality)
es: (0 = igualdad perfecta, 1 = desigualdad perfecta)

# influence_podium_title
source: Influence Podium
es: Podio de Influencia

# interactive_network_graph_title
source: Communication Network
es: Red de Comunicación

# key_relationships_title
source: Key Relationships
es: Relaciones Clave

# key_relationships_strong_pair
source: Strong Pair
es: Par Fuerte

# key_relationships_monologue
source: Monologue
es: Monólogo

# key_relationships_reciprocity
source: Reciprocity: {reciprocity}
es: Reciprocidad: {reciprocity}

# markov_simulation_view_button
source: 🔮 Simulate conversation
es: 🔮 Simular conversación

# markov_simulation_view_length
source: Length: {length} messages
es: Longitud: {length} mensajes

# markov_simulation_view_no_simulation
source: No simulation generated yet
es: Aún no hay simulación generada

# top_brokers_cards_no_brokers_message
source: No significant brokers found in this conversation. This suggests that communication is linear (A -> B -> C) or dispersed, without a single crucial "bridge" connecting other pairs of users.
es: No se encontraron brokers significativos en esta conversación. Esto sugiere que la comunicación es lineal (A -> B -> C) o dispersa, sin un único "puente" crucial que conecte a otros pares de usuarios.

# top_brokers_cards_broker_score
source: Broker Score: {score}
es: Puntuación de Broker: {score}

# top_brokers_cards_broker_description
source: This user acts as a key bridge between other participants.
es: Este usuario actúa como un puente clave entre otros participantes.

# top_transitions_view_title
source: Who Replies to Whom?
es: ¿Quién responde a quién?

# top_transitions_view_description
source: Top {topCount} of {maxTransitions} transitions
es: Top {topCount} de {maxTransitions} transiciones

# log_title
source: Log
es: Registro

# log_empty
source: (empty)
es: (vacío)

# info_wrapper_info_button
source: What does this mean?
es: ¿Qué significa esto?

# export_button_label
source: Export
es: Exportar

# export_csv
source: Export as CSV
es: Exportar como CSV

# export_json
source: Export as JSON
es: Exportar como JSON

# export_yaml
source: Export as YAML
es: Exportar como YAML

# export_toon
source: Export as TOON
es: Exportar como TOON

source: Export Image
es: Exportar Imagen

# export_exported_to
source: Exported to: {path}
es: Exportado a: {path}

# export_saved_image
source: Image saved to: {path}
es: Imagen guardada en: {path}

# export_error_no_directory
source: Could not find a suitable directory to save the file.
es: No se pudo encontrar un directorio adecuado para guardar el archivo.

# export_error_exporting
source: Error exporting: {error}
es: Error al exportar: {error}

# export_no_data_provided
source: No structured data provided to export.
es: No se proporcionaron datos estructurados para exportar.

# open_folder_action
source: Open Folder
es: Abrir carpeta

# share_message_analysis
source: Check out my chat analysis!
es: ¡Mira mi análisis de chat!

# share_exported_text
source: Exported {file}
es: Exportado {file}
